In [59]:
import pandas as pd

In [11]:
# sample data for indian students
data={
    "Name":["Aarav","Isha","Vivaan","Priya","Reyansh"],
    "Age":[20,21,22,23,24],
    "Grade":["A","B","A","C","B"],
    "City":["Delhi","Mumbai","Bangalore","Chennai","Hydrabad"]
}

In [21]:
df =pd.DataFrame(data)

In [17]:
#Display the dataframe
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B   Hydrabad

In [33]:
# Data for each column.
names=["Aarav","Isha","Vivaan","Priya","Reyansh"]
ages=[20,21,22,23,24]
grades=["A","B","A","C","B"]
cities=["Delhi","Mumbai","Bangalore","Chennai","Hydrabad"]

In [37]:
print(names)

['Aarav', 'Isha', 'Vivaan', 'Priya', 'Reyansh']

In [47]:
# Create dataframe using zip() to column the lists into the dictionary.
df =pd.DataFrame(list(zip(names,ages,grades,cities)),columns=["Name","Age","Grade","City"])

In [49]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B   Hydrabad

In [63]:
# Method 3 using numpys arrays.
import numpy as np

In [65]:
#using numpy arrays
names=np.array(["Aarav","Isha","Vivaan","Priya","Reyansh"])
ages=np.array([20,21,22,23,24])
grades=np.array(["A","B","A","C","B"])
cities=np.array(["Delhi","Mumbai","Bangalore","Chennai","Hydrabad"])

In [67]:
#creating Dataframe
df=pd.DataFrame({
    "Name":names,
    "Ages":ages,
    "Grade":grades,
    "City":cities
})

In [69]:
# Display Dataframe
df

      Name  Ages Grade       City
0    Aarav    20     A      Delhi
1     Isha    21     B     Mumbai
2   Vivaan    22     A  Bangalore
3    Priya    23     C    Chennai
4  Reyansh    24     B   Hydrabad

In [71]:
# Using panda.DataFrame.form_dict()
#creating dataframe.frame using dict.
df =pd.DataFrame.from_dict(data)

In [73]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B   Hydrabad

In [79]:
# Using pd.DataFrame() with a list of Dictionaries
#list of dictionaries represeting each Student's record
data=[
  {"Name":"Aarav","Age":20,"Grade":"A","City":"Delhi"},
  {"Name":"Isha","Age":21,"Grade":"B","City":"Mumbai"},
  {"Name":"Vivaan","Age":22,"Grade":"A","City":"Bangalore"},
  {"Name":"Priya","Age":23,"Grade":"C","City":"Chennai"},
  {"Name":"Reyansh","Age":24,"Grade":"B","City":"Hydrabad"}   
]

In [83]:
#creating DataFrame 
df=pd.DataFrame(data)

In [85]:
#Display DataFrame
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B   Hydrabad

In [107]:
row,column= df.shape

In [109]:
row

5

In [112]:
column

4

In [114]:
df[['Name','Age']][df['Grade']=='A']

     Name  Age
0   Aarav   20
2  Vivaan   22

In [116]:
df[['Name','Age']][df['Age']==df['Age'].max()]

      Name  Age
4  Reyansh   24

In [118]:
df

      Name  Age Grade       City
0    Aarav   20     A      Delhi
1     Isha   21     B     Mumbai
2   Vivaan   22     A  Bangalore
3    Priya   23     C    Chennai
4  Reyansh   24     B   Hydrabad

In [148]:
df.set_index('Age')

    Grade       City
Age
20      A      Delhi
21      B     Mumbai
22      A  Bangalore
23      C    Chennai
24      B   Hydrabad